# Welcome to the Data Manipulation Exercises

The workbook has been broken up into three sections.  Each section correlates to a reading assignment within the textbook.

In [1]:
import pandas as pd
import numpy as np

data= pd.read_csv("titanic.csv")

## Before You Get Started

We are going to be using the Titanic Dataset. Make sure to run a head() before you start working with manipulation methods.

In [30]:
# Run the head of your data set here:
data.head(20)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True

In [32]:
# check for duplicates
data.loc[data.duplicated() == True]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
47,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
76,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
77,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
87,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
95,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
870,0,3,male,26.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
877,0,3,male,19.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True

In [33]:
# if there are, go ahead and drop them:
data = data.drop_duplicates()

### Cleaning Note:

While the columns are not the "prettiest", don't adjust any of them yet. We are going to update some values and add some values as we work through this notebook. Apologies for the extra visual "noise" on your screen. You will be given the option to tidy up the columns at the end of this notebook.

## Running Tables Note:  
If your tables don't appear to have accepted your changes, try the "Run All" option in the "Cell" section of the menu bar.

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# A. Aggregation

1. Work through the section Exercises.  
    - There are 4 sections in part A:
        - Groupby
        - Aggregation Methods
        - Groupby and Basic Math
        - Groupby and Multiple Aggregations

#### Creating Variables.

As we begin to manipulate our data, create new variables to store your work in.  This will keep your original data intact.  Having the original dataset available will save you time with each manipulation.  You can also create variable names that inform you of the purpose of the manipulation.

### 1: Groupby <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Groupby "embark_town"

1. Using the titanic data set, groupby "embark_town".
1. Create a variable that will represent the grouping of data.
1. Initialize it using the groupby() function and pass it the column.

In [ ]:
# Code your groupby "embark_town" here:
groupedTown = data.groupby(["embark_town"])

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002573856ED50>

In [36]:
# To view the grouped data as a table, use the variable_name.first():
groupedTown.first()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone
embark_town,,,,,,,,,,,,,,
Cherbourg,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,yes,False
Queenstown,0,3,male,2.0,0,0,8.4583,Q,Third,man,True,C,no,True
Southampton,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,no,False

#### Groupby "survived"

Did you know that you can also chain on some of our exploratory methods to the groupby method?

1. Create & initalize a new variable to hold a table that will groupby "survived" 
1. Use method chaining to tack on the describe method

In [37]:
# Code your groupby "survived" table here:
groupedSurvival = data.groupby("survived")

# run your table below:
groupedSurvival.first()

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
survived,,,,,,,,,,,,,,
0,3,male,22.0,1,0,7.2500,S,Third,man,True,E,Southampton,no,False
1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [38]:
# run your table with describe
groupedSurvival.describe()

         pclass                                                 age  \
          count      mean       std  min  25%  50%  75%  max  count
survived
0         461.0  2.481562  0.770507  1.0  2.0  3.0  3.0  3.0  394.0
1         323.0  1.904025  0.856152  1.0  1.0  2.0  3.0  3.0  284.0

                     ... parch        fare                                     \
               mean  ...   75%  max  count       mean        std  min     25%
survived             ...
0         30.953046  ...   0.0  6.0  461.0  23.944531  33.336385  0.0   7.875
1         28.365915  ...   1.0  5.0  323.0  50.079180  68.009971  0.0  12.825


            50%       75%       max
survived
0         13.00  26.55000  263.0000
1         26.25  61.37915  512.3292

[2 rows x 40 columns]

In [ ]:
# How is this table organized?  Why are there 40 columns now?
# It is a regular describe, but grouped by whether or not the person survived. Each variable that could be described has been, and the results are displayed horizontally, still within the original groupings

### 2. Aggregation Methods <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Note: **agg()** and **aggregate()** are identical [source](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.aggregate.html)

#### Method Chaining

1. Create a variable to apply **agg()** to your grouped data.
1. Pass one of the following statistical values to **agg()**
   - "mean", "median", "mode", "min", "max", "std", "var", "first", "last", "sum"

In [ ]:
# Code your method chain here:
aggSumMinMax = ['sum', 'min', 'max']

In [45]:
# Create a variable to apply agg("sum") to your grouped data
aggSum = groupedTown.agg('sum')
# run your table:
aggSum

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone
embark_town,,,,,,,,,,,,,,
Cherbourg,90,282,femalefemalefemalemalemalefemalemalemalefemale...,3981.17,62,59,9875.0587,CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC...,FirstSecondThirdThirdFirstFirstFirstThirdThird...,womanchildwomanmanmanwomanmanmanchildmanchildm...,79,CBDBADBFBACBBADDCBDBCECBECBEDBECDCCDBBDCBBCCAC...,yesyesyesnonoyesnoyesyesnoyesnoyesnonononoyesn...,74
Queenstown,20,170,malemalefemalefemalefemalefemalemalefemalefema...,786.50,30,13,859.2459,QQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQ...,ThirdThirdThirdThirdThirdThirdThirdThirdThirdT...,manchildchildwomanwomanwomanmanwomanwomanmanma...,29,CECF,nonoyesyesyesyesnoyesyesnononoyesnoyesnoyesnon...,42
Southampton,211,1305,malefemalefemalemalemalemalefemalefemalefemale...,15383.75,318,254,16319.6993,SSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS...,ThirdThirdFirstThirdFirstThirdThirdThirdFirstT...,manwomanwomanmanmanchildwomanchildwomanmanmanc...,343,CEGCDACCCFFCEDCEDDCFCEBFAFGCCDGCBEBCCDACCCCDCC...,noyesyesnononoyesyesyesnononoyesyesnonoyesyesn...,328

In [ ]:
# Explain the sum table.  What is going on with the "sex", "class", and "alive" columns?

#It is simply a sum of all the column values that fit the groups. Ints and floats are added together, strings are tacked on to one another, in the same way that ('Im' + 'tired') becomes 'Imtired'

#### Using a Dictionary <span style="color:darkorange;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
##### A dictionary is a Python collection type.  

Is a collection type that stores **key-value pairs**.  A key-value pair is an organization system that is made up of a single *key* that has one or more *values* paired with it.  
Think of it like your contacts list.  The contacts list is the dictionary object.  
Each contact is organized by a key, usually name.  And attached to each name is contact information, or the values.
Some contacts might have email address, phone number, home or work address, etc. Other contacts may just be a name and phone number.  This is a very simple example, but understanding this organizational structure will be helpful as you learn to manipulate tables.  

*Here is a dictionary example with 3 keys:*
>**contacts_dictionary = {"name1": ["email", 555-5552, "work info"], 
      "name2": ["email", 555-5554],
      "name3": 555-5555}**
                     
*Here is a dictionary example with a single key-value pair*
**study_group_dictionary = {"john": ["john@email.com", 555-555-5555, "works at LaunchCode headquarters"]}**   

It has a single key, and a list of values. The organization of this structure is called a "Key-Value Pair".
Using the contact list example, the key would be the name of the person and the values would be their contact information.  The key is a single item (the person's name) and the values can be a single item (an email address) or mulitple items (email, phone number, address, work info, etc).
Keys and values can be any data type, but must use correct data type syntax.  The keys do not have to be strings, but they do need to be a single value.  

For more information, you can read more on dictionary objects [here](https://www.w3schools.com/python/python_dictionaries.asp).

#### Aggregation across multiple columns using dictionary functionality

##### Syntax Example:

**age_dictionary={"age":["sum", "max"]}**

We are creating a new dictionary (**age_dictionary**).  The key is **age** and the values we want are **"sum""** and **"max"**.  This dictionary object has now become a template for the aggregations we want to perform.  However, on it's own, it does nothing.  Once passed to the **agg()** method, it will pick out the specific location of data we want to examine, making a subset table.

The code is contained in the box below.  Run it and see what happens.


For syntax examples, review [this webpage](https://www.geeksforgeeks.org/python-pandas-dataframe-aggregate/).
#### <span style="color:coral;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In [46]:
# Predict the table output before you uncomment the code below.

# It will sum all values of the 'age' column and also display the max age. The column and aggregate functions to use are coded into age_dictionary, then dictionary_agg is running the coded column name and functions on the 'data' dataframe

age_dictionary={"age":["sum", "max"]}
dictionary_agg=data.agg(age_dictionary)
dictionary_agg

          age
sum  20251.42
max     80.00

1. What if we want to look at more than one column at a time?  We pass more dictionaries to the agg function.
1. Create a variable to hold at least 3 columns.  Use the syntax from the "Syntax Example" as a guide.
    - Aggregate the following:  survived: "sum" & "count"; age: "std" & "min", and sibsp: "count" & "sum"

In [49]:
# Code your dictionary here:
syntaxExample = {"survived":['sum', 'count'],
                 "age":["std", 'min'],
                 'sibsp':['count', 'sum']}
exampleSyntaxExample = data.agg(syntaxExample)
exampleSyntaxExample

       survived        age  sibsp
sum       323.0        NaN  410.0
count     784.0        NaN  784.0
std         NaN  14.759076    NaN
min         NaN   0.420000    NaN

### 3. Groupby and Basic Math <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Groupby "pclass".  Make sure you use a variable to hold your grouped data.

In [50]:
# <WARNING> For this section, you will need to filter out non-numeric data to run the aggregations
# The line below creates a new dataframe with only numeric columns to avoid warnings
num_only_data = data.select_dtypes(include='number')

# Code your groupby here using num_only_data:
peeClass = num_only_data.groupby("pclass")

# Run your table using first() here instead of head():
peeClass.first()

        survived   age  sibsp  parch     fare
pclass
1              1  38.0      1      0  71.2833
2              1  14.0      1      0  30.0708
3              0  22.0      1      0   7.2500

### 4. Groupby and Multiple Aggregations <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Group with a List<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1. We want to do muliple aggregation functions to our newly grouped data set.  We created a variable to hold a list of functions we want to perform.  These functions are part of the agg method.  When we pass our list to the method, the method will iterate through each item and perform that function for the entire table.

In [51]:
# our list of functions
agg_func_list = ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']


#Apply the agg method to our passenger_class variable (made in the Groupby Basic Math section).  
# Pass our list to the function and run your table.
peeClass.agg(agg_func_list)

       survived                                                                \
            sum      mean median min max       std       var first last count
pclass
1           135  0.630841    1.0   0   1  0.483709  0.233974     1    1   214
2            84  0.509091    1.0   0   1  0.501439  0.251441     1    0   165
3           104  0.256790    0.0   0   1  0.437403  0.191321     0    0   405

        ...        fare                                                \
        ...         sum       mean   median  min       max        std
pclass  ...
1       ...  18080.3917  84.487812  60.2875  0.0  512.3292  78.645207
2       ...   3602.8417  21.835404  18.7500  0.0   73.5000  13.475409
3       ...   5530.7705  13.656223   8.0500  0.0   69.5500  10.666808


                var    first   last count
pclass
1       6185.068602  71.2833  30.00   214
2        181.586649  30.0708  10.50   165
3        113.780790   7.2500   7.75   405

[3 rows x 50 columns]

#### Group with a Dictionary<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Using only a list provides us with the entire table.  What if we only want to look at age vs pclass?  

we can create a dictionary to hold the age column for us.  The *key* would be the name of our column, and the values our list of functions to perform on that column.  The code would look like this:

In [52]:
agg_func_dict = {
    'age':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
# We would run our table like this:
# passenger_class.agg(agg_func_dict)

Looking at the *age_func_dict* syntax, create a dictionary variable for the "survived" column and pass it to **passenger_class.agg()** in the box below.

In [56]:
# Code it here:
survivalDict = {
    'survived':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}

peeClass.agg(survivalDict)

       survived
            sum      mean median min max       std       var first last count
pclass
1           135  0.630841    1.0   0   1  0.483709  0.233974     1    1   214
2            84  0.509091    1.0   0   1  0.501439  0.251441     1    0   165
3           104  0.256790    0.0   0   1  0.437403  0.191321     0    0   405

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# B. Recoding and Creating New Values and Variables 

1. Work through the Part B, there are 3 sections

### Create a New Column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In the box below:
1. Create a new column by manipulating the values of an existing column.  Specifically, create a new column, "fare_2021" that allows us to compare the cost of fare in pounds back in 1912 to 2021.  The inflation multiplier from 1912 to 2021 is approximately 117.17.

In [58]:
# Code your new "fare_2021" column here:
data["fare_2021"] = round((data["fare"]*117.17), 2)
# Run the head of your table to see your new column:
data.head(15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,849.48
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,8352.26
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,928.57
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,6221.73
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,943.22
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,991.06
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,6076.73
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,2469.36
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,1304.49
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,3523.40
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False,1956.74
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True,3110.86
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,943.22
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False,3664.49
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True,920.28

### Replacing Values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
 
Replace the string-based "yes","no" values in the "alive" column using booleans, replacing "yes" values with True and "no" values with False.

In [ ]:
# Code your updated values here:
# I am legitimately unsure what the question is asking here, because it feels identical to the following. See following cell for proper replacement of yes/no to True/False

We can also use functions to update values.

1. Create a function that will convert the string-based "alive" values of "yes" or "no" to a boolean value of True or False. Apply it to your table and run your table here:

In [62]:
# Code your function here:
data["alive"] = data["alive"].replace(to_replace={'yes': True, 'no': False})
data.head(15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False,849.48
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False,8352.26
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True,928.57
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False,6221.73
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,943.22
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,False,True,991.06
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,False,True,6076.73
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,False,False,2469.36
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,True,False,1304.49
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,True,False,3523.40
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,True,False,1956.74
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,True,True,3110.86
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,943.22
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,False,False,3664.49
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,False,True,920.28

### Using a function to create a new column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

Sometimes you might want to create a new column based on combining multiple columns together.

1. create an "age_group" column that breaks years up as 0-19, 20-29, 30-39, etc until all given ages are covered.  Make sure you check to see where you can stop counting by 10s.

In [ ]:
# Write your max age check here:
data["age"].agg('max')
#Max age is 80

np.float64(80.0)

In [65]:
# Code the new "age_group" column function here:
data["age_group"] = pd.cut(
    data["age"],
    bins=[0, 20, 30, 40, 50, 60, 70, 80], 
    labels=['Child/Teens', '20s', '30s', '40s', '50s', '60s', '70+']
)
data.head(15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021,age_group
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False,849.48,20s
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False,8352.26,30s
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True,928.57,20s
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False,6221.73,30s
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,943.22,30s
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,False,True,991.06,NaN
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,False,True,6076.73,50s
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,False,False,2469.36,Child/Teens
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,True,False,1304.49,20s
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,True,False,3523.40,Child/Teens
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,True,False,1956.74,Child/Teens
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,True,True,3110.86,50s
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,943.22,Child/Teens
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,False,False,3664.49,30s
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,False,True,920.28,Child/Teens

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# C. Reshaping Tables

1. Work through Part C, there are 4 sections

### Sort_values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Use **sort_values()** to answer the following question:
> What is the age of the person who paid the highest fare?

Hint: We want to see the highest fare value first. To find this, should we set the sort order to ascending or descending?  Check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values) for the syntax.

In [67]:
# Code your sort_values here:

data["fare"].sort_values(ascending=False)

# Run your table here:

data.sort_values(by='fare', ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021,age_group
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,True,False,60029.61,30s
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,True,True,60029.61,30s
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,True,True,60029.61,30s
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,True,False,30815.71,20s
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,True,False,30815.71,20s
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271,1,3,male,25.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,True,True,0.00,20s
806,0,1,male,39.0,0,0,0.0000,S,First,man,True,A,Southampton,False,True,0.00,30s
179,0,3,male,36.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,False,True,0.00,30s
263,0,1,male,40.0,0,0,0.0000,S,First,man,True,B,Southampton,False,True,0.00,30s
815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,False,True,0.00,NaN

### pivot_table <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
1. pivot the table of the summed data where the values are "fare", index is "who" and "age_group", and the columns are "survived"

Hint: set the aggfunc parameter to np.sum

In [71]:
# Code your pivot_table here:
pivotIndex = ['who', 'age_group']
pivot_table = data.pivot_table(values='fare', aggfunc='sum', index=pivotIndex, columns='survived')

# Run your table here:
print(pivot_table)

survived                   0          1
who   age_group
child Child/Teens  1109.5459  1592.4168
      20s             0.0000     0.0000
      30s             0.0000     0.0000
      40s             0.0000     0.0000
      50s             0.0000     0.0000
      60s             0.0000     0.0000
      70+             0.0000     0.0000
man   Child/Teens  1005.9333   176.4292
      20s          2347.7413   625.5583
      30s          1358.4455  1685.9501
      40s          1199.7208   569.3293
      50s           735.4792   171.7500
      60s           602.4375    10.5000
      70+            99.6834    30.0000
woman Child/Teens   144.6250  1243.0209
      20s           419.0750  2839.3083
      30s           141.5667  3273.4124
      40s           260.4917  1491.9418
      50s            10.5000   962.8125
      60s             0.0000   167.5458
      70+             0.0000     0.0000

C:\Users\pyadr\AppData\Local\Temp\ipykernel_1276\2411304484.py:3: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot_table = data.pivot_table(values='fare', aggfunc='sum', index=pivotIndex, columns='survived')

### Wide to Long <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Create a table where the columns are "who" and the values are "pclass"
1. Answer the question:  How does this table differ from the pivot_table above?  Specifically, how is "who" different?

In [ ]:
# Code your table here:
whoList = ['child', 'man', 'woman']
pList = [1, 2, 3]
whoPeeClass = pd.melt(pivot_table, var_name="who", value_name="pclass")

# Run your table here:
whoPeeClass

# Answer the question here:

#Who is now a counting integer that (I'm guessing) is binning the prior groups but also if they're a survivor or not. I am unsure if this syntax is correct, but after trying to run it with just the dataframe I received a billion errors and passing
    # pivot table through melt is the only way I could make it work. The instructions here make very little sense. The lesson text is also almost zero help in telling us what is going on here, as the dataframe represented in it is not at all the one we're 
    # using and is instead

    who     pclass
0     0  1109.5459
1     0     0.0000
2     0     0.0000
3     0     0.0000
4     0     0.0000
5     0     0.0000
6     0     0.0000
7     0  1005.9333
8     0  2347.7413
9     0  1358.4455
10    0  1199.7208
11    0   735.4792
12    0   602.4375
13    0    99.6834
14    0   144.6250
15    0   419.0750
16    0   141.5667
17    0   260.4917
18    0    10.5000
19    0     0.0000
20    0     0.0000
21    1  1592.4168
22    1     0.0000
23    1     0.0000
24    1     0.0000
25    1     0.0000
26    1     0.0000
27    1     0.0000
28    1   176.4292
29    1   625.5583
30    1  1685.9501
31    1   569.3293
32    1   171.7500
33    1    10.5000
34    1    30.0000
35    1  1243.0209
36    1  2839.3083
37    1  3273.4124
38    1  1491.9418
39    1   962.8125
40    1   167.5458
41    1     0.0000

### Melt <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1.  What does the **melt** function do to the data?

In [ ]:
# What does melt do?
# Melt allows you to change the columns and general shape of your dataframe while still keeping all associated data points tied together

2.  With a new variable, apply a default melt to your data.

In [ ]:
# Create your default melt table here with the following syntax:  new_name = pd.melt(data_set)
new_name = pd.melt(data)
# Run your table here:
new_name
# Check the shape of your new table.
# It is in fact 2 columns and 13327 lines instead of the much more easily understandable prior version

        variable        value
0       survived            0
1       survived            1
2       survived            1
3       survived            1
4       survived            0
...          ...          ...
13323  age_group          30s
13324  age_group  Child/Teens
13325  age_group          NaN
13326  age_group          20s
13327  age_group          30s

[13328 rows x 2 columns]

3. Create a melt table where the index variables are "embarked", and the values are "fare" and "deck"

In [ ]:
# Create your melt table here:
valuesOfMelt = ('fare', 'deck')
meltedTable = pd.melt(data, id_vars='embarked', value_vars=valuesOfMelt)
# Run your table here:
meltedTable
# Check the shape

#I have legitimately no idea what I am supposed to be looking at here because the lesson itself explains almost nothing and the dataset used for the lessons is so woefully inadequate compared to the one we've used for this that it's impossible to tell
    # if what's happening is because of poor syntax on my end or this is just how it's supposed to look
#EDIT: After googling I learned that "id_vars" exists as something you can put in the melt command. That would have been nice to see at any point in the lesson.

     embarked variable    value
0           S     fare     7.25
1           C     fare  71.2833
2           S     fare    7.925
3           S     fare     53.1
4           S     fare     8.05
...       ...      ...      ...
1563        Q     deck      NaN
1564        S     deck        B
1565        S     deck      NaN
1566        C     deck        C
1567        Q     deck      NaN

[1568 rows x 3 columns]

# Optonal Challenges:

1. Clean and Explore the table.  
    1. How would you handle any missing data?
    1. Would you keep all of the columns?
    1. Would you want to manipulate any data?

In [ ]:
#I just want to state in here explicitly that this singular assignment that we had 4 days to complete was more work (with less guidance) than the 9 to 5 project we had a full month to do.